//  5. Написать программу вычисления значения функции y = f(a)

Console.Write("Найдем значение y = f(a).\nВведите значение a = ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write($"y = {a}");